src/test/resources/__files/payment-response.json

{
    "version": "2024",
    "paymentKey": "payment_key_123",
    "type": "BILLING",
    "orderId": "order_123",
    "orderName": "구독 결제",
    "mId": "toss_mid_123",
    "currency": "KRW",
    "method": "카드",
    "totalAmount": 10000,
    "balanceAmount": 10000,
    "status": "DONE",
    "requestedAt": "2024-01-01T12:00:00+09:00",
    "approvedAt": "2024-01-01T12:00:01+09:00",
    "useEscrow": false,
    "lastTransactionKey": "trans_123",
    "suppliedAmount": 9090,
    "vat": 910,
    "cultureExpense": false,
    "taxFreeAmount": 0,
    "taxExemptionAmount": 0,
    "cancels": null,
    "isPartialCancelable": true
}